


SELECT [параметры] FROM [таблица]
  [WHERE условие]
  [GROUP BY тип_группировки]
  [HAVING определение_where]
  [ORDER BY тип_упорядочения]
  [LIMIT критерий_ограничения]
  [PROCEDURE имя_процедуры]

Операции в WHERE
Функции агрегирования
Операции подзапросов

UPDATE [таблица] SET столбец1 = выражение1, стоблец2 = выражение2 ...
  [WHERE условие]
  [ORDER BY критерий_сортировки]
  [LIMIT количество]

INSERT INTO [таблица] (столбец1, столбец2, столбец3, ...)
  VALUES (значение1, значение2, занчение3, ...)

DELETE FROM [таблица]
  [WHERE условие]
  [ORDER BY столбцы упорядоч]
  [LIMIT количество]